Case II/S7/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   36;

method               simple;

simpleCoeffs
{
    n                    (4 3 3);
    delta                0.001;
}

hierarchicalCoeffs
{
    n                    (2 2 1);
    delta                0.001;
    order                xyz;
}

manualCoeffs
{
    dataFile             "decompositionData";
}

// ************************************************************************* //
